In [34]:
import pandas as pd
import numpy as np

In [ ]:
X=pd.Series(['1.0','2000',3000]), Y=pd.to_numeric(X), //data to number(integer or numeric)
Z=pd.Series(['1.0','#Mrinal',2000) will produce error if numericic conversion is done without using X=pb.to_numeric(s,errors='coerce'),
dic={'A':['DS','FD','KI'],'B':['jk','io',np.nan'],'C':[np.nan,np.nan,44]};
X=pd.DataFrame(dic)
X.shape,X.info(),del X['Col'],X.isnull().sum(),//display total no. of nan value of each columns, X['Col'].value_counts()//display freq of each data in cols
X.dropna(),X.dropna(axis=0)//drop row with nan// X.dropna(axis=1) //drop coloumn with nan
X.dropna(subset=['Col'])//drop rows with nan in a Col column// dropna(thresh=4)//showing rows with atleast 4 normal value(non nan)
X.fillna('Hai'),X.fillna(X.mean()),
X.replace(4,'four'),X.replace([3,32],'mrinal'),X.replace([5,6],[22,443]),X.iloc[1,2]='@#!1213As'
X.replace(regex=True,to_replace='[0-9]',value='')
[0-9],[A-Z],[a-z],[1-9] : display all except these sepcified characters
[^0-9],[^A-Z],[^a-z],[^1-9] : only display these sepcified characters. 
[A-Za-z][^A-Za-z][A-Za-z][A-Z1-9][a-zA-Z1-9]
X.iloc[:,1:3]=X.iloc[:,1:3].replace(regex=True,to_replace='[0-9]',value='') //specifying location to perform operation
X.replace(np.nan,'?'),
X['Col']=pd.to_numeric(X['Col'])//convert data types

In [35]:
s=pd.Series(['1.0','2000',3000])

In [21]:
s # or print(s2)

0     1.0
1    2000
2    3000
dtype: object

In [17]:
s1=pd.to_numeric(s)

In [18]:
s1

0       1.0
1    2000.0
2    3000.0
dtype: float64

In [24]:
s2=pd.Series(['1.0','APPLe',2000])

In [20]:
s2

0       1.0
1    #APPLe
2      2000
dtype: object

In [25]:
s2=pd.to_numeric(s2) #error becasue of s2 is not of numnerical values

ValueError: Unable to parse string "APPLe" at position 1

In [29]:
 a=pd.to_numeric(s2,errors='coerce')

In [30]:
a

0       1.0
1       NaN
2    2000.0
dtype: float64

In [50]:
dc={'training':['HJ','FG','ED','KI'],'hours':[np.nan,np.nan,4,3],'tools':[np.nan,np.nan,np.nan,32]}

In [55]:
dc

{'training': ['HJ', 'FG', 'ED', 'KI'],
 'hours': [nan, nan, 4, 3],
 'tools': [nan, nan, nan, 32]}

In [226]:
df=pd.DataFrame(dc)

In [53]:
df

  training  hours  tools
0       HJ    NaN    NaN
1       FG    NaN    NaN
2       ED    4.0    NaN
3       KI    3.0   32.0

In [56]:
df.shape

(4, 3)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training    4 non-null object
hours       2 non-null float64
tools       1 non-null float64
dtypes: float64(2), object(1)
memory usage: 224.0+ bytes

In [58]:
df.isnull().sum()

training    0
hours       2
tools       3
dtype: int64

In [59]:
df.dropna(axis=0)

  training  hours  tools
3       KI    3.0   32.0

In [60]:
df.dropna(axis=1)

  training
0       HJ
1       FG
2       ED
3       KI

In [61]:
df.dropna(subset=['hours'])

  training  hours  tools
2       ED    4.0    NaN
3       KI    3.0   32.0

In [65]:
df.dropna(subset=['tools'])

  training  hours  tools
3       KI    3.0   32.0

In [81]:
df.dropna(thresh=2) # display all column more than or eqal to 2 normal values

  training  hours  tools
2       ED    4.0    NaN
3       KI    3.0   32.0

In [78]:
df.dropna(thresh=1) #check for column with atleast normal value(non NAN value)

  training  hours  tools
0       HJ    NaN    NaN
1       FG    NaN    NaN
2       ED    4.0    NaN
3       KI    3.0   32.0

In [84]:
df.dropna(thresh=3)

  training  hours  tools
3       KI    3.0   32.0

In [83]:
df.fillna('hai')

  training hours tools
0       HJ   hai   hai
1       FG   hai   hai
2       ED     4   hai
3       KI     3    32

In [298]:
df.fillna(df.mean())

  training  hours  tools
0       HJ    3.5   32.0
1       FG    3.5   32.0
2       ED    4.0   32.0
3       KI    3.0   32.0

In [90]:
df.replace(4,'four')

  training hours  tools
0       HJ   NaN    NaN
1       FG   NaN    NaN
2       ED  four    NaN
3       KI     3   32.0

In [98]:
df.replace([3,32],'mrinakl')

  training    hours    tools
0       HJ      NaN      NaN
1       FG      NaN      NaN
2       ED        4      NaN
3       KI  mrinakl  mrinakl

In [100]:
df.replace([3,32],[454,231])

  training  hours  tools
0       HJ    NaN    NaN
1       FG    NaN    NaN
2       ED    4.0    NaN
3       KI  454.0  231.0

In [136]:
df.iloc[1,2]='@~_12PaHE'
df.iloc[2,2]='n&I}1FRe32'

In [137]:
df

  training  hours       tools
0       HJ    NaN         NaN
1       FG    NaN   @~_12PaHE
2       ED    4.0  n&I}1FRe32
3       KI    3.0          32

In [110]:
df.replace(regex=True, to_replace='[0-9]',value='')

  training  hours    tools
0       HJ    NaN      NaN
1       FG    NaN  @~_PaHE
2       ED    4.0  n&I}FRe
3       KI    3.0       32

In [113]:
df.replace(regex=True, to_replace='[A-Z]',value='')

  training  hours    tools
0             NaN      NaN
1             NaN   @~_12a
2             4.0  n&}1e32
3             3.0       32

In [116]:
df.replace(regex=True,to_replace='[^A-Z]',value='')

  training  hours tools
0       HJ    NaN   NaN
1       FG    NaN   PHE
2       ED    4.0   IFR
3       KI    3.0    32

In [121]:
df.replace(regex=True,to_replace='[a-z]',value='')

  training  hours     tools
0       HJ    NaN       NaN
1       FG    NaN  @~_12PHE
2       ED    4.0  &I}1FR32
3       KI    3.0        32

In [123]:
df.replace(regex=True,to_replace='[^a-z]',value='')

  training  hours tools
0             NaN   NaN
1             NaN     a
2             4.0    ne
3             3.0    32

In [124]:
df.replace(regex=True,to_replace='[A-Za-z]',value='')

  training  hours  tools
0             NaN    NaN
1             NaN  @~_12
2             4.0  &}132
3             3.0     32

In [126]:
df.replace(regex=True,to_replace='[^A-Za-z]',value='')

  training  hours  tools
0       HJ    NaN    NaN
1       FG    NaN   PaHE
2       ED    4.0  nIFRe
3       KI    3.0     32

In [140]:
df.replace(regex=True,to_replace='[A-Z1-9]',value='')

  training  hours tools
0             NaN   NaN
1             NaN  @~_a
2             4.0  n&}e
3             3.0    32

In [138]:
df.replace(regex=True,to_replace='[A-Za-z1-9]',value='')

  training  hours tools
0             NaN   NaN
1             NaN   @~_
2             4.0    &}
3             3.0    32

In [142]:
df.replace(regex=True,to_replace='[A-Z1-9]',value='')

  training  hours tools
0             NaN   NaN
1             NaN  @~_a
2             4.0  n&}e
3             3.0    32

In [177]:
df.iloc[:,1:3]=df.iloc[:,1:3].replace(regex=True,to_replace='[^0-9]',value='')

In [178]:
del df['traning'] #i dont know why it is giving error # so not executed

   hours tools
0    NaN   NaN
1    NaN    12
2    NaN   132
3    NaN    32

In [183]:
df.info() # there are some NAN value. Lets replace it

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
hours    0 non-null float64
tools    3 non-null object
dtypes: float64(1), object(1)
memory usage: 192.0+ bytes

In [219]:
df # i have again executed the df command that was used during starting of the pgm that why it gets again initialized

  training  hours  tools
0       HJ    NaN    NaN
1       FG    NaN    NaN
2       ED    4.0    NaN
3       KI    3.0   32.0

In [220]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training    4 non-null object
hours       2 non-null float64
tools       1 non-null float64
dtypes: float64(2), object(1)
memory usage: 224.0+ bytes

In [221]:
df.replace(np.nan,'?')

  training hours tools
0       HJ     ?     ?
1       FG     ?     ?
2       ED     4     ?
3       KI     3    32

In [222]:
df.isnull().sum() # earlier we are just replacing not making changes in df

training    0
hours       2
tools       3
dtype: int64

In [223]:
df

  training  hours  tools
0       HJ    NaN    NaN
1       FG    NaN    NaN
2       ED    4.0    NaN
3       KI    3.0   32.0

In [224]:
df=df.dropna()

In [225]:
df # it is droping entire row with nan value so instead we can use some functino to convert to a data type

  training  hours  tools
3       KI    3.0   32.0

In [230]:
df # yes i have again intiliazed df value to its original form before executing it

  training  hours  tools
0       HJ    NaN    NaN
1       FG    NaN    NaN
2       ED    4.0    NaN
3       KI    3.0   32.0

In [231]:
df['hours']=pd.to_numeric(df['hours']) #converting daat type to int or float. so now it wil not dispaly objet as data type

In [232]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training    4 non-null object
hours       2 non-null float64
tools       1 non-null float64
dtypes: float64(2), object(1)
memory usage: 224.0+ bytes

In [235]:
df.isnull().sum()

training    0
hours       2
tools       3
dtype: int64

In [236]:
df['tools']=pd.to_numeric(df['tools'])

In [239]:
df.info() # data type of column tools is coverted from object to float

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training    4 non-null object
hours       2 non-null float64
tools       1 non-null float64
dtypes: float64(2), object(1)
memory usage: 224.0+ bytes